Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR34_DFP/2.1.61/edc/ATSAMR34J18B.PIC
      <edc:SFRDef edc:_addr="0x42002C0C" edc:access="------nn" edc:cname="WAVE" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="WAVEGEN" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NFRQ" edc:desc="Normal frequency" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MFRQ" edc:desc="Match frequency" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="NPWM" edc:desc="Normal PWM" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="MPWM" edc:desc="Match PWM" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002C0D" edc:access="------nn" edc:cname="DRVCTRL" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="INVEN0" edc:desc="Output Waveform Invert Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEN1" edc:desc="Output Waveform Invert Enable 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42002C0E" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x42002C0F" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Run During Debug" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002C10" edc:access="------------------------rrrrrrrr" edc:cname="SYNCBUSY" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="swrst" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:desc="CTRLB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STATUS" edc:desc="STATUS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC0" edc:desc="Compare Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC1" edc:desc="Compare Channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42002C14" edc:offset="0x7EC"/>
      <edc:SFRDef edc:_addr="0x42003400" edc:access="------------nnnn-nnnnnnnnnnnnnnn" edc:cname="CTRLA" edc:impl="0xF7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AESMODE" edc:desc="AES Modes of operation" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="CFBS" edc:desc="CFB Types" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="KEYSIZE" edc:desc="Keysize" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CIPHER" edc:desc="Cipher mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTMODE" edc:desc="Start mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOD" edc:desc="LOD Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEYGEN" edc:desc="Last key generation" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XORKEY" edc:desc="Xor Key operation" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CTYPE" edc:desc="Counter measure types" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003404" edc:access="----nnnn" edc:cname="CTRLB" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="START" edc:desc="Manual Start" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NEWMSG" edc:desc="New message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOM" edc:desc="End of message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMUL" edc:desc="GF Multiplication" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003405" edc:access="------nn" edc:cname="INTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="ENCCMP" edc:desc="Encryption Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMCMP" edc:desc="GF Multiplication Complete" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003406" edc:access="------nn" edc:cname="INTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="ENCCMP" edc:desc="Encryption Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMCMP" edc:desc="GF Multiplication Complete" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
