Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR34_DFP/2.1.61/edc/ATSAMR34J18B.PIC
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x42002814" edc:cname="COUNT" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4200281B" edc:cname="PER" edc:mclr="11111111" edc:nzwidth="0x8" edc:por="11111111" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4200281C" edc:cname="CC0" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Counter/Compare Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4200281D" edc:cname="CC1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Counter/Compare Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="USB/DEVICE">
      <edc:SFRDef edc:access="nnnn-nnn" edc:addr="0x41000100" edc:cname="EPCFG0" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPTYPE0" edc:desc="End Point Type0" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE1" edc:desc="End Point Type1" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnn-nnn" edc:addr="0x41000180" edc:cname="EPCFG4" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPTYPE0" edc:desc="End Point Type0" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE1" edc:desc="End Point Type1" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="wwww-www" edc:addr="0x41000184" edc:cname="EPSTATUSCLR4" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:desc="Data Toggle OUT Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:desc="Data Toggle IN Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:desc="Stall 0 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:desc="Stall 1 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="wwww-www" edc:addr="0x41000104" edc:cname="EPSTATUSCLR0" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:desc="Data Toggle OUT Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:desc="Data Toggle IN Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:desc="Stall 0 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:desc="Stall 1 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="wwww-www" edc:addr="0x41000185" edc:cname="EPSTATUSSET4" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:desc="Data Toggle OUT Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:desc="Data Toggle IN Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:desc="Stall 0 Request Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:desc="Stall 1 Request Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
